Repository: ImanKari/G9SuperNetCore
Catalog: G9SuperNetCoreServer/G9Common/Resource/LogMessage.*.resx
Languages: fa

source: AccountAdded
fa: اضافه کردن اکانت

source: AccountAndSessionCreated
fa: اکانت و نشست با موفقیت ایجاد شد.

source: ArgumentNotCorrect
fa: پارامتر درست نیست!

source: ArgumentXNotCorrect
fa: پارامتر '{0}' به درستی وارد نشده است!

source: Body
fa: بدنه

source: BufferSize
fa: سایز بافر

source: CantStopStoppedServer
fa: سرور متوقف است، نمی توانید آن را مجددا متوقف کنید.

source: ClientPing
fa: پینگ کلاینت

source: ClientPingDateTime
fa: تاریخ و زمان آخرین پینگ

source: ClientSessionIdentity
fa: کد منحصر به فرد کلاینت

source: CloseReason
fa: دلیل بسته شدن

source: Command
fa: کامند

source: CommandEcho
fa: دریافت کامند اکو

source: CommandLengthError
fa: طول (تعداد کاراکتر ها) کامند وارد شده از مقدار مجاز بیشتر است

source: CommandName
fa: نام کامند

source: CommandNotFound
fa: کامندی با نام مورد نظر وجود ندارد

source: CommandSendType
fa: نوع داده ارسالی کامند

source: CommandSendTypeNotCorrect
fa: مقدار ارسالی برای این کامند درست نیست.

source: CommanTestSendReceive
fa: دریافت از کامند تست ارسال و دریافت بین سرور و کلاینت

source: CreateAndInitializeClient
fa: ساخت و مقدار دهی اولیه کلاینت

source: CreateAndInitializeServer
fa: ساخت و مقدار دهی اولیه سرور

source: CreateNewAccount
fa: ساخت اکانت جدید

source: CurrentSessionCount
fa: تعداد کل نشست های متصل (کلاینت ها)

source: DataLength
fa: طول داده

source: DisableCommandTestModeForAllClients
fa: توقف کامند تست ارسال و دریافت بین سرور و کلاینت برای تمامی کلاینت ها

source: DisableCommandTestModeForSingleSession
fa: توقف کامند تست ارسال و دریافت بین سرور و کلاینت برای یک کلاینت

source: EnableCommandTestModeForAllClients
fa: فعال سازی کامند تست ارسال و دریافت بین سرور و کلاینت برای تمامی کلاینت ها

source: EnableCommandTestModeForSingleSession
fa: فعال سازی کامند تست ارسال و دریافت بین سرور و کلاینت برای یک کلاینت

source: ErrorInRunningCommand
fa: در روند اجرای کامند خطایی رخ داده است.

source: FailBindAndListenSocket
fa: در روند آماده سازی انتظار سرور برای اتصال کلایت مشکلی پیش آمده است

source: FailClientReceive
fa: خطا در روند دریافت داده های ارسالی توسط کلاینت

source: FailClinetConnection
fa: اتصال کلایت به سرور با خطا رو به رو شده است

source: FailedOperation
fa: عملیات ناموفق

source: FailGeneratePacket
fa: در زمان ساخت بسته ارسالی خطا رخ داده است

source: FailReceiveClientFromServer
fa: در روند دریافت داده های ارسالی توسط سرور خطا رخ داده است

source: FailRequestSendData
fa: در روند ارسال داده خطا رخ داده است

source: FailSendComandByName
fa: روند ارسال کامند همگام Sync با استفاده از نام با مشکل مواجه شده است

source: FailSendComandByNameAsync
fa: روند ارسال کامند ناهمگام Async با استفاده از نام با مشکل مواجه شده است

source: FailSendComandByNameToAll
fa: در روند ارسال کامند به تمامی کلاینت ها خطایی رخ داده است

source: FailSendComandByNameToAllAsync
fa: در روند ارسال کامند به صورت ناهمگام به تمامی کلاینت ها خطایی رخ داده است

source: FailStopServer
fa: در روند توقف سرور مشکلی ایجاد شده است

source: FailtOnWaitForConnection
fa: در حالت انتظار برای اتصال کانکشن مشکلی ایجاد شده است

source: IpAddress
fa: آی پی آدرس

source: LastCommandUsed
fa: آخرین کامند استفاده شده

source: LastCommandUsedDateTime
fa: تاریخ و زمان آخرین کامند استفاده شده

source: LengthEntered
fa: طول (تعداد کاراکتر) وارد شده

source: OnSessionClose
fa: قطع ارتباط یک کانکشن و بستن نشست

source: PacketRequestId
fa: آی دی منحصر به فرد بسته

source: PacketType
fa: نوع بسته

source: Port
fa: پورت

source: ProblemAddingAccount
fa: مشکل در روند اضافه کردن اکانت به مجموعه

source: ProblemCreateNewAccountAndSession
fa: مشکل در روند ساخت اکانت و نشست

source: ProblemCreateServerSocket
fa: مشکل در روند ساخت سوکت

source: ReceiveClientFromServer
fa: شروع روند دریافت داده های ارسالی توسط سرور

source: ReceiveData
fa: داده دریافتی

source: ReceivedUnhandledCommand
fa: یک کامند مدیریت نشده دریافت شده است

source: ReceiveRequestOverTheLimit
fa: دریافت بسته (پاکت) بیش از حد مجاز تعیین شده در کانفیگ سرور

source: RequestSendData
fa: درخواست ارسال دیتا

source: RunningCommand
fa: کامند در حال اجرا

source: SendTypeWithFunction
fa: نوع داده ارسالی توسط تابع

source: ServerStartDateTime
fa: زمان و تاریخ شروع کار سرور

source: ServerTotalReceiveBytes
fa: کل دیتای دریافتی توسط سرور به بایت

source: ServerTotalReceivePacket
fa: تعداد کل پکت دریافتی توسط سرور

source: ServerTotalSendBytes
fa: کل دیتای ارسالی توسط سرور به بایت

source: ServerTotalSendPacket
fa: تعداد کل پکت ارسالی توسط سرور

source: ServerUpTime
fa: مدت زمان کارکرد

source: StandardLength
fa: طول (تعداد کاراکتر) مجاز

source: StartClientConnection
fa: شروع اتصال کلاینت به سرور

source: StartServer
fa: شروع کار سرور

source: StopServer
fa: توقف سرور

source: SuccessAccountAdded
fa: اکانت با موفقیت به مجموعه اضافه شد

source: SuccessBindAndListenSocket
fa: روند آماده سازی سرور برای انتظار ارتباط کلایت با موفقیت انجام شد

source: SuccessClientConnection
fa: اتصال کلاینت به سرور با موقیت برقرار شد

source: SuccessClientReceive
fa: داده های ارسالی توسط کلاینت با موفقیت دریافت شد

source: SuccessCreateServerSocket
fa: ساخت موفقیت آمیز سوکت

source: SuccessfulOperation
fa: عملیات موفق

source: SuccessRequestSendData
fa: ارسال داده با موفقیت انجام شد

source: SuccessUnpackingReceiveData
fa: داده های دریافتی با آنالیز و به بسته مورد نیاز تبدیل شد

source: TestNumber
fa: تعداد تست

source: TotalSessionFromStartServerCount
fa: تعداد کل نشست های که از زمان شروع سرور تا به الان به سرور متصل شده اند

source: UnhandledCommand
fa: کامند مدیریت نشده

source: WaitForConnection
fa: در حالت انتظار برای اتصال یک کانکشن(کلاینت)

source: Waiting
fa: در حال انتظار

source: Warning
fa: اخطار
